app/Http/Controllers/UserMainController.php

select * from `tickets` where `tickets`.`event_id` in (10)
select `name`, `id` from `categories` where `categories`.`id` in (3)
---
    public function show($event_id)
    {
        //
        $event = events::with('category:name,id','tickets')->findOrFail($event_id);

select * from `categories` where `categories`.`id` in (1)
select * from `shows` where `shows`.`event_id` in (1, 2, 3, 4)
---
    public function show_categ_events($id)
    {
        $categories = categories::all();
        $events = events::with('shows','category')->PublishedEvents()->where('categ_id',$id)->get();